<template>
  <section>
    <section class="news-detail">
      <div>
        <div class="title">{{ currentContent.title }}</div>
        <div class="date">{{ currentContent.date }}</div>
      </div>
      <div class="content">
        <div
          :class="{'imgs':item.indexOf('/_nuxt') >-1}"
          v-for="item in currentContent.contentList"
          :key="item"
        >
          <p v-if="item.indexOf('/_nuxt') < 0">{{ item }}</p>
          <img
            v-else
            :src="item"
            alt=""
          />
        </div>
      </div>
      <footers></footers>
    </section>
    <section class="news-detail-mobile">
      <div>
        <div class="title">{{ currentContent.title }}</div>
        <div class="date">{{ currentContent.date }}</div>
      </div>
      <div class="content">
        <div
          :class="{'imgs':item.indexOf('/_nuxt') >-1}"
          v-for="item in currentContent.contentList"
          :key="item"
        >
          <p v-if="item.indexOf('/_nuxt') < 0">{{ item }}</p>
          <img
            v-else
            :src="item"
            alt=""
          />
        </div>
      </div>
      <footer-mobile></footer-mobile>
    </section>
  </section>
</template>

<script>
import footers from "~/components/footers.vue";
import footerMobile from "~/components/footer-mobile.vue";
export default {
  name: "newsDetail",

  data() {
    return {
      title: "新闻详情",
      newsId: 0,
      currentContent: {},
      newList: [
        {
          id: 1,
          title: '志业人才推出"微笑口罩计划"，缓解就业压力',
          date: "2020-04-23 17:08:35",
          contentList: [
            '"近日，由志业人才发起的一场旨在缓解零售业企业用工荒，稳定餐饮行业员工等重点群体就业的"微笑口罩计划"在徐汇区街头正有声有色地展开。',
            require("~/assets/images/newsDetail/news1/1.jpg"),
            '"微笑口罩计划"是由志业人才联合创始人尤清清组织发起，他结合志业人才的企业优势，率先推出《"微笑口罩"上海零售业岗位支援计划》，该计划一经推出，便在网络上获得了大量点赞和支持。期间发布的《战"疫"招募令》更是在短时内获得了超过了10 万的浏览量。',
            require("~/assets/images/newsDetail//news1/2.jpg"),
            '自活动发起的3天时间，志业人才发起的"微笑口罩计划"已经吸引了数十家零售业龙头企业加盟，组织了458名求职者在线面试，为当地提供了5360个保障民生的基层岗位，成功实现183名求职者入职到岗，促成了一批餐饮企业与零售企业之间的员工共享。"微笑口罩计划"不仅是徐汇区吹响复工复产号角的关键一步，更是志业人才旗下"志业蛙招聘"在解决新生代蓝领人才用工方案的重要尝试。',

            '"志业蛙招聘"前身是"职业蛙招聘"，隶属于上海志业人才服务集团旗下。此外，志业人才集团旗下还有"开拓者零工"、"志业实训学校"、"志业.AIjob"等多个品牌。志业人才是集职业教育+人力资源服务+人工智能于一体的现代服务业人才生涯服务领跑者，公司始终致力于提供的优质的人才服务、深度定制人才培养方案，并通过聚焦现代服务业、制造业服务外包、人才招聘与派遣等服务，为广大蓝领人才提供全方位职业生涯服务。志业人才建立以来，为广大求职者提供了众多优质岗位和就业机会，凭借"招人快、选人准、用人稳"的核心优势，累计帮助百万人入职，与数千家企业建立了合作关系，在上海、北京、杭州、川渝、武汉、成都、西安、南京等地均有设立办事处，通过深度定制化解决了全国企业的新生代蓝领用工痛点。此外，公司将人工智能与招聘相结合，拥有150万蓝领数据库支持比同行高30%以上的人岗匹配度，同比节省了企业30%的面试时间，降低了客户22%左右的员工流失率，为客户节省了高昂的培训和管理成本。在成立的两年内，全国累计超过8.6万人次通过志业人才入职心仪企业，而在过去的18个月里累计流水已经突破9000万。',
            "志业人才将为合作伙伴提供创造和实现梦想的机会作为企业愿景，致力于为促进社会就业做出贡献，为现代服务业人才的职业生涯提供服务。随着志业人才集团与全国超50余所中高职院校联合实训学院的建立，结合AI技术驱动的测学聘一体化平台和大数据精准匹配，通过人才、资本、技术、资源的聚合，志业人才正在成为新蓝领领域信赖的领军品牌。"
          ]
        },
        {
          id: 2,
          title: "带动10000+人就业的90后女孩:这才刚刚开始",
          date: "2019-06-26 17:00",
          contentList: [
            "马云曾在做演讲中表示:” 男人会把公司越做越大，女人会把公司越做越好。上世纪，企业越大越好，本世纪，做好企业比做大企业重要得多。如果做企业的人不从女性身上学到这些特质，未来很难走下去。”",
            "女性在当下已经发生了很大变化，马云还提到，以前很多女性的梦想就是嫁个好男人有个好孩子，但现在很多女性的梦想是改变世界。“我相信本世纪女性真正能够成为推动社会政治、文化、经济进步的主要力量。”",
            "的确，由于女性本身感性、包容、坚韧的特质，让她们对事物的感知更细腻、洞察力也更加敏锐，在创业过程中，往往很容易成为组织中的协调者，更大化发掘团队中每个人的能力，维系好内部关系，促进外部关系的拓展。",
            "女性的思考更加依赖直觉，能够在很复杂的事情中看到本质，“举个简单的例子，很少有人能够瞒过妈妈的，我发现要瞒老爸还容易，但是要瞒老妈很难。”",
            "在这个讲究体验和服务的时代，女性的创业优势正逐渐彰显。",
            "“职业蛙”创始人尤清清就是这样一位女性创业者。作为一个普通的90后女孩，凭借着独特的观察力、细腻的处事方式、努力敢拼的韧性，带动了10000+人的就业，为世界增色的同时也收获了创业路上的一路繁花。",
            require("~/assets/images/newsDetail/news2/1.jpeg"),
            "01 女性创业者更具有独到眼光",
            "创业初期，像很多初入创业路的女性一样，尤清清也遇到了来自团队管理方面的难题。不因为性别的差异而被孤立隔阂成为包括尤清清在内的很多创业女性不得不面对的挑战。",
            "在采访中，同为合伙人的男生笑着评价尤清清拥有着亲和热情的个人魅力，在招纳人才方面眼光独到，能够从女性的角度发现很多一般男性不容易想到的问题。",
            require("~/assets/images/newsDetail/news2/2.jpeg"),
            "02 “用服务说话” ",
            "刚刚过去的2018年，是“职业蛙”发展极为重要的一年。",
            "2018年“职业蛙”累计为企业输送就业10000余人次EFG上海师范大学分会的“天使基金”资助",
            "不仅如此，今年3月份，在尤清清团队带领下的“职业蛙”，凭借着出色的业务能力及高效的管理经营，得到了投资人的青睐，获得校友企业一千万种子轮融资。",
            require("~/assets/images/newsDetail/news2/3.jpeg"),
            "对“职业蛙”未来的发展，心思细腻的尤清清早已有了规划。为了将线下体验做大，从今年开始将会更大范围地辐射全国连锁餐饮企业。",
            "用服务说话，一直是“职业蛙”坚持的理念。",
            "在一次竞标项目中，“职业蛙”创新性地提出“服务体验式竞标”，让客户先体验输送的人员提供的服务，对“职业蛙的”服务水平和诚意感到满意，这才一举战胜比之规模更大的强劲对手成功中标。",
            "尤清清坦言：“目前为止，我们获得了很多大品牌的信赖，经常有人问我是不是有什么秘籍，其实所谓的秘籍就是：用服务说话。”",
            "谈及创业一路走来的艰辛，这位刚刚毕业却已是品牌CEO的女性创业者由衷地感叹道：“创业真的很不容易，一路走来也许我们比别人拥有更多的就是坚持吧”",
            "03 创业，为梦想而执着",
            "谈及创业一路走来的艰辛，这位刚刚毕业却已是品牌CEO的女性创业者由衷地感叹道：“创业真的很不容易，一路走来也许我们比别人拥有更多的就是坚持吧”",
            "女性创业者俨然已成为经济浪潮中不可取代的强势力量，新经济的发展也带给了女性更多的创业机会，更多和尤清清一样的女性创业者正在向世界展示她们至坚至柔而特独的创造力和领导力。"
          ]
        },
        // {
        //   id: 3,
        //   title:
        //     "她为4.6万人找到工作，她穿上旗袍做直播，她带领200位绣娘脱贫…… ",
        //   date: "2020-06-10 19:56",
        //   contentList: [
        //     '"由徐汇区人社局和红河州人社局共同主办的 2020徐汇-红河“创业梦之星”评选于6月9日在徐汇通、哔哩哔哩和抖音直播上进行了“云启动”。',
        //     require("~/assets/images/newsDetail/news3/1.png"),
        //     "本次活动中有三位女性创业者格外抢眼",
        //     "快随小编一起来认识一下她们吧！",
        //     require("~/assets/images/newsDetail/news3/2.gif"),
        //     "蓝领猎头”平台职业蛙招聘创始人尤清清",
        //     require("~/assets/images/newsDetail/news3/3.png"),
        //     "在今年新冠疫情期间，“职业蛙”与徐汇区人社局共同发起了 “微笑口罩计划”，通过岗位配置的社会化互助共享，缓解零售业企业的“用工荒”。“职业蛙”还结合就业扶贫工作，积极对接云南和贵州地区，在当地招募劳动力赴上海工作。疫情以来，已累计为8.7万人提供职业咨询，4.63万人成功入职，大多来自云南、贵州、河南的贫困家庭。本次启动仪式上， 职业蛙招聘创始人尤清清分享了这段“赋能式”扶贫经历。",
        //     "另外两位是 聚焦上海城市文化的钲艺廊联合创始人王璐和 聚焦传统手工艺的云南的麦羽轩传承创业者张华。她们以连线的方式一同走进“徐汇-红河两地创业者互助带货”直播间。",
        //     require("~/assets/images/newsDetail/news3/4.png"),
        //     "相隔2600公里的“她”力量。",
        //     require("~/assets/images/newsDetail/news3/5.jpeg"),
        //     require("~/assets/images/newsDetail/news3/6.png"),
        //     "“我是第一次直播带货，但创业者就是要有这样的精神，勇于面对挑战。”穿上海派特色的旗袍，画上精致优雅的淡妆，“钲艺廊”品牌创始人王璐走进直播间，与她连线直播“带货”的，则是远在2600公里之外，来自云南省红河州石屏县的彝族姑娘张华。",
        //     "短短半小时的直播中， 上海海派工艺品“海上砖”与 彝族花腰刺绣频频“同框”，从产品的背后的设计故事到产品所代表的城市或手工艺特色的介绍，两位女创业者的带货变成了 “文化传承”课堂。",
        //     require("~/assets/images/newsDetail/news3/7.jpeg"),
        //     "“钲艺廊”的代表产品——手绘珐琅釉面砖海上砖，以上海石库门元素为肌理，通过开发八音盒、杯、盘、文具、家居装饰等衍生产品，在方寸之间用釉面质感和多样色彩传播上海本土文化。",
        //     require("~/assets/images/newsDetail/news3/8.png"),
        //     "石屏县彝族尼苏（花腰）刺绣，即人们常说的“花腰彝刺绣”，是花腰彝人在长期生产劳动中创造、世代口口相传的民族文化艺术，有重要的历史文化价值。作为“绣美彝山”刺绣合作社的创始人，张华也是石屏花腰彝刺绣的非遗传承人。创业仅两年，她就带领全县400余名妇女进行刺绣培训，签约绣娘200余名，并让绣娘手头的“针线活”变为了“金线活”。",
        //     require("~/assets/images/newsDetail/news3/9.png"),
        //     "想了解她们更多的故事？",
        //     "也有创业梦想？",
        //     "有好的创业项目？",
        //     "也想成为如此优秀的那个她？",
        //     "徐汇创业梦之星活动报名仍在进行中",
        //     "夜空中最亮的星星，是你吗？",
        //     "创业不易",
        //     "为每一个努力的“她”点赞！",
        //     require("~/assets/images/newsDetail/news3/10.gif")
        //   ]
        // },
        {
          id: 4,
          title:
            "徐汇区人社局联合EFG“天使基金”资助企业职业蛙招聘平台，推出“微笑”系列计划",
          date: "2020-06-16 16:11:16",
          contentList: [
            "2019年岁末，一场突如其来的新冠肺炎疫情打破了浓浓的新春氛围，党中央高度对此重视，习近平总书记指示：“要把人民生命安全和身体健康放在第一位”，2020年1月23日，随着一声令下，武汉封城，全国医护人员大动员，纷纷投入到一线的战疫之中。",
            "此时上海，主要负责用人、招工、就业的徐汇区人社局敏锐的察觉到，为了阻断病毒采取的全国各地交通限流措施，会给上海这座有400多万外来务工人员的城市带来巨大的用工压力。",
            "疫情期间用工难，“微笑”计划解心烦",
            "徐汇区人社局紧急启动政企联动预案，紧急联合EFG“天使基金”曾资助企业“职业蛙”招聘平台，推出针对新冠疫情下用人单位和务工人员对接工作的“微笑口罩计划”。",
            "由人社部牵头组织资源，“职业蛙”负责运营实施，旨在帮助因疫情影响原有员工无法及时返工的服务业、物流业企业和当地有相关经验求职者实现短期快速对接。",
            "经过人社局与职业蛙招聘平台功能同努力，共有16家零售和物流企业提供了5000多个保障民生的岗位，为了快速帮助在沪务工人员了解相关政策消息，人社局通过徐汇公众号青年乐业上和市人社乐业上海公众号发布了《战役招募令》，结合“职业蛙”自身品牌流量，项目仅启动3天就收到了3000多名求职者在线咨询，为十几家企业解决了眼前的用工荒难题。",
            "微笑”脚步不停歇，助力各地用工人员返沪",
            "随着疫情的进一步严重，春节假期后并没有迎来企业期待的返工潮，人们被困在家中无法大规模流动，全国各地开始大面积出现用工难，上海市作为务工人员主要输入地，尤为明显。",
            "面对严峻的形势，党中央、国务院高度重视， 《政府工作报告》也指出“今年要优先稳就业保民生”，为了贯彻落实人社部、市人社局在保就业方面的举措，徐汇区人社局决定趁热打铁，在与职业蛙招聘平台合作的基础上，又联合58家企业将原有的沪对沪“微笑口罩”计划升级为全国对沪的“微笑口罩-春风送岗”计划。",
            "在徐汇区人社局的牵线下，职业蛙招聘平台联系到贵州，河南，四川等多省、市人社部门，成功助力几千名外出赴沪务工人员乘坐“微笑口罩专列”达到上海，并根据上海市防疫指挥部的要求，完成了隔离、检验等一系列措施。与此同时，在与用工单位对接方面开辟了绿色通道，全力保障外来务工人员顺利返沪复工，尽可能的减轻就业者负担和顾虑。",
            "就业的形式多种多样，在保证用工企业与务工人员对接的同时，徐汇区人社局也在促进“以创业带动就业”，3月末，由徐汇区人社局和红河州人社局共同主办的2020徐汇•红河“创业梦之星”评选活动正式启动。徐汇区人力资源和社会保障局局长陈继刚和云南省红河州人力资源和社会保障局局长戴劲松以“视频连线”的方式正式签署“2020年就业扶贫工作协议”，同时连线的还有“最美创业带头人”、聚焦于传统文化创业的云南红河创业者张华和徐汇本土创业梦之星“职业蛙”联合创业者尤清清",
            require("~/assets/images/newsDetail/news4/1.png"),
            require("~/assets/images/newsDetail/news4/2.png"),
            "随着“微笑口罩计划”的升级，职业蛙招聘平台将进一步落实就业扶贫工作，目前正积极对接云南和贵州地区人力资源单位，帮助近千名受疫情影响无法正常工作，没有收入来源的贫困农民工成功进入上海市多家制造业工厂就业。",
            "对口支援，全力解决应届毕业生就业难题",
            "随着“微笑口罩-春风送岗”计划的影响力逐步扩大，徐汇区人社局带领职业蛙平台开展的 “微笑”系列助力复工复产计划也得到了越来越多的认可已关注，为了响应国务院、国家人社部关于提倡疫情期间确保高等学校毕业生就业等一系列的通知要求，徐汇区人社局再次抓住时机，指导并鼓励“职业蛙”再度将“微笑”系列计划升级为“微笑口罩-高校生就业支援计划”，旨在为解决全国高校应届毕业生严峻的就业问题出一份力。",
            "截止目前，已经有100多家连锁服务企业加入招聘阵营中。“职业蛙”校企事业线同事们从4月份至今，一直冲在一线，对接全国各大中高职院校，已成功经为3400多名中高职院校学生匹配好实习企业。",
            "抗疫还在路上，由徐汇区人社局指导，职业蛙招聘平台协助的“微笑口罩计划”、“微笑口罩-春风送岗计划”及“微笑口罩-高校生就业支援计划”三部曲，得到了近百家企业的积极响应，服务对象从起初的服务业、物流业，成功扩展到制造业与餐饮业等多个行业，为上万名来自全国各地的各类人才、贫困农民工及应届毕业生成功找到心仪的工作岗位。",
            "继续响应国家号召，走产教融合技能扶贫道路",
            "面对疫情冲击，人社部认真贯彻中央决策部署，会同有关部门不断强化政策供给，减负、稳岗、扩就业多措并举，各地人社部门积极响应，在就业群体方面紧紧围绕高校毕业生、农民工、退役军人、就业困难人员等强化精准帮扶，加速兑现国有企事业单位招聘、基层项目招录、研究生和专升本招生、就业见习等各项毕业生扩招渠道，强化政策支持、一对一帮扶，促进市场化社会化就业。",
            "在扩增量方面主要围绕政策联动、产业带动、支持自主创业、鼓励灵活就业四个方面来着力拓宽就业空间。同时提到，灵活就业是扩就业的重要渠道，要进一步加大对劳动者平台就业的扶持力度，清理取消涉就业的不合理限制和收费，支持多渠道灵活就业。",
            "作为现代服务业人才生涯服务领导者，“职业蛙”未来会继续根据人社局的指导，参与到扶贫工作中，通过本次疫情，职业蛙的品牌影响力和行业号召力再升一个台阶。",
            "尤清清在提到未来关于“职业蛙”发展方向的时候说道：“为了更好的在疫情期间发挥职业蛙的职能作用，下一步我们会积极响应国家扶贫号召，在徐汇人社的指导下，积极联动贵州，云南，河南政府，针对重点贫困地区建档立卡，为贫困户提供东部优质劳动就业机会。从对接单个服务业企业，拓展到联动大型连锁服务业企业，另一面加强与职业教育院校深度合作，走产教融合技能扶贫道路，同时为建档立卡的贫困户学生提供学习救助金，帮助贫困户学生提升职业技能水平，为贫困学生提供良好的就业机会和就业指导。”"
          ]
        }
      ]
    };
  },
  computed: {},
  components: { footers, footerMobile },
  created() {
    //
  },
  watch: {
    $route() {
      this.getRouteParams();
    }
  },
  mounted() {
    this.getRouteParams();
  },
  destroyed() {},
  methods: {
    getRouteParams() {
      const params = this.$route.params;
      if (params.detail) {
        this.newsId = params.detail;
        this.currentContent = this.newList.find(
          item => Number(item.id) === Number(this.newsId)
        );
      }
    }
  }
};
</script>

<style lang="stylus" scoped>
.news-detail {
  position: relative;
  color: #434343;

  &>div {
    width: 833px;
    margin: auto;
  }

  .title {
    font-size: 21px;
    font-weight: bold;
  }

  .date {
    font-size: 16px;
  }

  .content {
    text-align: center;

    p {
      margin: 21px 0;
      text-align: left;
    }

    .imgs {
      text-align: center;
    }

    img {
      width: 718px;
      margin: 21px auto;
    }
  }
}

.news-detail-mobile {
  display: none;

  &>div {
    padding: 0.27rem 0.35rem;
    width: auto;
    position: relative;
  }

  .content {
    padding: 0 0.35rem 0.27rem 0.35rem;
    margin-top: -0.12rem;

    p {
      margin: 0.35rem 0;
      font-size: 0.2rem;
      overflow: hidden;
      text-overflow: ellipsis;
      display: -webkit-box;
      -webkit-line-clamp: 3;
      -webkit-box-orient: vertical;
    }

    .imgs {
      text-align: center;
    }

    img {
      width: 5.69rem;
      margin: 0.21rem auto;
    }
  }

  .title {
    font-size: 0.24rem;
  }

  .date {
    font-size: 0.16rem;
  }
}

@media screen and (max-width: 960px) {
  .news-detail {
    display: none;
  }

  .news-detail-mobile {
    display: block;
  }
}
</style>
